/* Задача: Написать программу, которая из имеющегося массива строк формирует 
новый массив из строк, длина которых меньше, либо равна 3 символам. 
Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. 
При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами. 

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []

*/

// m1 - Изначальный массив
// m2 - Искомый массив

/*
Шпаргалка по шаблону

1. using System; - Директива использования пространства имен `System`, 
которая обеспечивает доступ к стандартным классам и структурам, 
определенным в пространстве имен `System`. 
Среди них есть такие классы, как `Console`, `String`, `Math` и многие другие.

2. class Program
Это определение класса, который содержит метод Main, который запускает программу. В данном случае, класс называется "Program".

3. static void Main(string[] args)
Статический метод "Main". Точка входа в программу. Этот метод получает массив строковых аргументов "args" (например, аргументы командной строки), на данный момент он пустой.

Внутри тела метода "Main" обычно помещается код программы, который будет выполняться при запуске приложения.  Код, который будет выполняться в данном случае, нужно помещать между фигурными скобками `{ ... }`.
Таким образом, данный код является стартовой точкой и пустым шаблоном для создания нового консольного приложения на C#.
*/


using System;
class Program
{
    static void Main(string[] args)
    {


        
    }
    
}

